--- crates/infra/src/event_store/command_adapters.rs
+++ replace <impl CharacterCommands for CharacterCommandsImpl>::create -> Result<(Uuid, AggregateVersion), DomainError> with Ok((Default::default(), Default::default()))
@@ -104,21 +104,17 @@
 impl CharacterCommandsImpl {
     pub fn new(cmd_service: CommandService) -> Self {
         Self { cmd_service }
     }
 }
 
 impl CharacterCommands for CharacterCommandsImpl {
     async fn create(&self, cmd: CreateCharacter) -> Result<(Uuid, AggregateVersion), DomainError> {
-        let id = cmd.id;
-        let result = CharacterAggregate::execute(&self.cmd_service, id, cmd)
-            .expected_version(ExpectedVersion::Empty)
-            .await;
-        map_executed(id, result)
+        Ok((Default::default(), Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn update_measurements(
         &self,
         cmd: UpdateMeasurements,
     ) -> Result<AggregateVersion, DomainError> {
         let id = cmd.id;
         let version = cmd.version;
