--- crates/infra/src/event_store/command_adapters.rs
+++ replace <impl CharacterCommands for CharacterCommandsImpl>::update_measurements -> Result<AggregateVersion, DomainError> with Ok(Default::default())
@@ -115,23 +115,17 @@
             .await;
         map_executed(id, result)
     }
 
     async fn update_measurements(
         &self,
         cmd: UpdateMeasurements,
     ) -> Result<AggregateVersion, DomainError> {
-        let id = cmd.id;
-        let version = cmd.version;
-        check_nonzero_version(version)?;
-        let result = CharacterAggregate::execute(&self.cmd_service, id, cmd)
-            .expected_version(ExpectedVersion::Exact(domain_to_stream(version).unwrap()))
-            .await;
-        map_version_only(result)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn update_contact_info(
         &self,
         cmd: UpdateContactInfo,
     ) -> Result<AggregateVersion, DomainError> {
         let id = cmd.id;
         let version = cmd.version;
