--- crates/infra/src/event_store/command_adapters.rs
+++ replace <impl CostumeCommands for CostumeCommandsImpl>::update_notes -> Result<AggregateVersion, DomainError> with Ok(Default::default())
@@ -160,23 +160,17 @@
         let id = cmd.id;
         let result = CostumeAggregate::execute(&self.cmd_service, id, cmd)
             .expected_version(ExpectedVersion::Empty)
             .await;
         map_executed(id, result)
     }
 
     async fn update_notes(&self, cmd: UpdateCostumeNotes) -> Result<AggregateVersion, DomainError> {
-        let id = cmd.id;
-        let version = cmd.version;
-        check_nonzero_version(version)?;
-        let result = CostumeAggregate::execute(&self.cmd_service, id, cmd)
-            .expected_version(ExpectedVersion::Exact(domain_to_stream(version).unwrap()))
-            .await;
-        map_version_only(result)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn assign_to_character(
         &self,
         cmd: AssignCostumeToCharacter,
     ) -> Result<AggregateVersion, DomainError> {
         let id = cmd.id;
         let version = cmd.version;
