--- crates/infra/src/event_store/command_adapters.rs
+++ replace <impl CalculationCommands for CalculationCommandsImpl>::create -> Result<(Uuid, AggregateVersion), DomainError> with Ok((Default::default(), Default::default()))
@@ -250,21 +250,17 @@
     }
 }
 
 impl CalculationCommands for CalculationCommandsImpl {
     async fn create(
         &self,
         cmd: CreateCalculation,
     ) -> Result<(Uuid, AggregateVersion), DomainError> {
-        let id = cmd.id;
-        let result = CalculationAggregate::execute(&self.cmd_service, id, cmd)
-            .expected_version(ExpectedVersion::Empty)
-            .await;
-        map_executed(id, result)
+        Ok((Default::default(), Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn update_header(&self, cmd: UpdateHeaderInfo) -> Result<AggregateVersion, DomainError> {
         let id = cmd.id;
         let version = cmd.version;
         check_nonzero_version(version)?;
         let result = CalculationAggregate::execute(&self.cmd_service, id, cmd)
             .expected_version(ExpectedVersion::Exact(domain_to_stream(version).unwrap()))
