--- crates/infra/src/event_store/command_adapters.rs
+++ replace <impl CalculationCommands for CalculationCommandsImpl>::update_header -> Result<AggregateVersion, DomainError> with Ok(Default::default())
@@ -258,23 +258,17 @@
         let id = cmd.id;
         let result = CalculationAggregate::execute(&self.cmd_service, id, cmd)
             .expected_version(ExpectedVersion::Empty)
             .await;
         map_executed(id, result)
     }
 
     async fn update_header(&self, cmd: UpdateHeaderInfo) -> Result<AggregateVersion, DomainError> {
-        let id = cmd.id;
-        let version = cmd.version;
-        check_nonzero_version(version)?;
-        let result = CalculationAggregate::execute(&self.cmd_service, id, cmd)
-            .expected_version(ExpectedVersion::Exact(domain_to_stream(version).unwrap()))
-            .await;
-        map_version_only(result)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn add_item(&self, cmd: AddCalculationItem) -> Result<AggregateVersion, DomainError> {
         let id = cmd.id;
         let version = cmd.version;
         check_nonzero_version(version)?;
         let result = CalculationAggregate::execute(&self.cmd_service, id, cmd)
             .expected_version(ExpectedVersion::Exact(domain_to_stream(version).unwrap()))
