--- crates/infra/src/event_store/command_adapters.rs
+++ replace <impl CalculationCommands for CalculationCommandsImpl>::add_item -> Result<AggregateVersion, DomainError> with Ok(Default::default())
@@ -268,23 +268,17 @@
         check_nonzero_version(version)?;
         let result = CalculationAggregate::execute(&self.cmd_service, id, cmd)
             .expected_version(ExpectedVersion::Exact(domain_to_stream(version).unwrap()))
             .await;
         map_version_only(result)
     }
 
     async fn add_item(&self, cmd: AddCalculationItem) -> Result<AggregateVersion, DomainError> {
-        let id = cmd.id;
-        let version = cmd.version;
-        check_nonzero_version(version)?;
-        let result = CalculationAggregate::execute(&self.cmd_service, id, cmd)
-            .expected_version(ExpectedVersion::Exact(domain_to_stream(version).unwrap()))
-            .await;
-        map_version_only(result)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn update_item(
         &self,
         cmd: UpdateCalculationItem,
     ) -> Result<AggregateVersion, DomainError> {
         let id = cmd.id;
         let version = cmd.version;
