--- crates/infra/src/event_store/command_adapters.rs
+++ replace <impl CalculationCommands for CalculationCommandsImpl>::mark_item_unpaid -> Result<AggregateVersion, DomainError> with Ok(Default::default())
@@ -317,23 +317,17 @@
             .await;
         map_version_only(result)
     }
 
     async fn mark_item_unpaid(
         &self,
         cmd: MarkItemAsUnpaid,
     ) -> Result<AggregateVersion, DomainError> {
-        let id = cmd.id;
-        let version = cmd.version;
-        check_nonzero_version(version)?;
-        let result = CalculationAggregate::execute(&self.cmd_service, id, cmd)
-            .expected_version(ExpectedVersion::Exact(domain_to_stream(version).unwrap()))
-            .await;
-        map_version_only(result)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn map_version_only<Ent, Err>(
     result: Result<ExecuteResult<Ent>, ExecuteError<Err>>,
 ) -> Result<AggregateVersion, DomainError>
 where
     Ent: kameo_es::Entity + kameo_es::Apply + std::fmt::Debug + Send + Sync + 'static,
