--- crates/infra/src/event_store/command_adapters.rs
+++ replace map_version_only -> Result<AggregateVersion, DomainError> with Ok(Default::default())
@@ -334,19 +334,17 @@
 
 fn map_version_only<Ent, Err>(
     result: Result<ExecuteResult<Ent>, ExecuteError<Err>>,
 ) -> Result<AggregateVersion, DomainError>
 where
     Ent: kameo_es::Entity + kameo_es::Apply + std::fmt::Debug + Send + Sync + 'static,
     Err: Into<DomainError> + std::fmt::Debug + Send + Sync + 'static,
 {
-    let (id, version) = map_executed_result(Uuid::nil(), result)?;
-    let _ = id;
-    Ok(version)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn map_executed<Ent, Err>(
     id: Uuid,
     result: Result<ExecuteResult<Ent>, ExecuteError<Err>>,
 ) -> Result<(Uuid, AggregateVersion), DomainError>
 where
     Ent: kameo_es::Entity + kameo_es::Apply + std::fmt::Debug + Send + Sync + 'static,
