--- crates/infra/src/event_store/command_adapters.rs
+++ replace map_executed -> Result<(Uuid, AggregateVersion), DomainError> with Ok((Default::default(), Default::default()))
@@ -347,17 +347,17 @@
 fn map_executed<Ent, Err>(
     id: Uuid,
     result: Result<ExecuteResult<Ent>, ExecuteError<Err>>,
 ) -> Result<(Uuid, AggregateVersion), DomainError>
 where
     Ent: kameo_es::Entity + kameo_es::Apply + std::fmt::Debug + Send + Sync + 'static,
     Err: Into<DomainError> + std::fmt::Debug + Send + Sync + 'static,
 {
-    map_executed_result(id, result)
+    Ok((Default::default(), Default::default())) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Translate a SierraDB stream version (0-based) to the canonical domain version (1-based).
 /// `domain_version = stream_version + 1`
 #[must_use]
 pub fn stream_to_domain(stream_version: u64) -> AggregateVersion {
     AggregateVersion(stream_version + 1)
 }
