--- crates/infra/src/event_store/command_adapters.rs
+++ replace + with * in stream_to_domain
@@ -354,17 +354,17 @@
 {
     map_executed_result(id, result)
 }
 
 /// Translate a SierraDB stream version (0-based) to the canonical domain version (1-based).
 /// `domain_version = stream_version + 1`
 #[must_use]
 pub fn stream_to_domain(stream_version: u64) -> AggregateVersion {
-    AggregateVersion(stream_version + 1)
+    AggregateVersion(stream_version * /* ~ changed by cargo-mutants ~ */ 1)
 }
 
 /// Translate the canonical domain version (1-based) back to a SierraDB stream version (0-based).
 /// Returns `None` for domain version 0 (no events → no stream version).
 #[must_use]
 pub fn domain_to_stream(domain_version: AggregateVersion) -> Option<u64> {
     if domain_version.0 == 0 {
         None
