--- crates/infra/src/event_store/command_adapters.rs
+++ replace == with != in domain_to_stream
@@ -361,17 +361,17 @@
 pub fn stream_to_domain(stream_version: u64) -> AggregateVersion {
     AggregateVersion(stream_version + 1)
 }
 
 /// Translate the canonical domain version (1-based) back to a SierraDB stream version (0-based).
 /// Returns `None` for domain version 0 (no events → no stream version).
 #[must_use]
 pub fn domain_to_stream(domain_version: AggregateVersion) -> Option<u64> {
-    if domain_version.0 == 0 {
+    if domain_version.0 != /* ~ changed by cargo-mutants ~ */ 0 {
         None
     } else {
         Some(domain_version.0 - 1)
     }
 }
 
 fn map_executed_result<Ent, Err>(
     id: Uuid,
