--- crates/infra/src/event_store/command_adapters.rs
+++ replace map_executed_result -> Result<(Uuid, AggregateVersion), DomainError> with Ok((Default::default(), Default::default()))
@@ -376,43 +376,17 @@
 fn map_executed_result<Ent, Err>(
     id: Uuid,
     result: Result<ExecuteResult<Ent>, ExecuteError<Err>>,
 ) -> Result<(Uuid, AggregateVersion), DomainError>
 where
     Ent: kameo_es::Entity + kameo_es::Apply + std::fmt::Debug + Send + Sync + 'static,
     Err: Into<DomainError> + std::fmt::Debug + Send + Sync + 'static,
 {
-    match result {
-        Ok(ExecuteResult::Executed(events)) => {
-            let version = events
-                .last()
-                .map(|e| stream_to_domain(e.stream_version))
-                .ok_or_else(|| DomainError::Conflict("command produced no events".into()))?;
-            Ok((id, version))
-        }
-        Ok(ExecuteResult::Idempotent { current_version }) => {
-            Ok((id, version_from_current(current_version)))
-        }
-        Ok(ExecuteResult::PendingTransaction { .. }) => Err(DomainError::Conflict(
-            "pending transaction not supported".into(),
-        )),
-        Err(ExecuteError::Handle(err)) => Err(err.into()),
-        Err(ExecuteError::IncorrectExpectedVersion {
-            stream_id,
-            current,
-            expected: _,
-            ..
-        }) => Err(DomainError::VersionConflict {
-            entity: stream_id.to_string(),
-            expected: AggregateVersion(0),
-            current: version_from_current(current),
-        }),
-        Err(err) => Err(DomainError::Conflict(err.to_string())),
-    }
+    Ok((Default::default(), Default::default())) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Map `CurrentVersion` to the canonical domain version.
 /// `Empty` (no events) → `AggregateVersion(0)` — no domain version yet.
 /// `Current(v)` (SierraDB reports version `v`) → `AggregateVersion(v + 1)`.
 fn version_from_current(current: CurrentVersion) -> AggregateVersion {
     match current {
         CurrentVersion::Current(v) => stream_to_domain(v),
