--- crates/infra/src/event_store/command_adapters.rs
+++ replace version_from_expected -> AggregateVersion with Default::default()
@@ -418,21 +418,17 @@
         CurrentVersion::Current(v) => stream_to_domain(v),
         CurrentVersion::Empty => AggregateVersion(0),
     }
 }
 
 /// Map `ExpectedVersion` to the canonical domain version.
 /// Only used in error context to inform the caller what they supplied.
 fn version_from_expected(expected: ExpectedVersion) -> AggregateVersion {
-    match expected {
-        ExpectedVersion::Exact(v) => AggregateVersion(v),
-        ExpectedVersion::Empty => AggregateVersion::INITIAL,
-        _ => AggregateVersion::INITIAL,
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Check that a domain version is non-zero (valid for update operations).
 /// Returns `DomainError::VersionConflict` when `version.0 == 0`.
 fn check_nonzero_version(version: AggregateVersion) -> Result<(), DomainError> {
     if version.0 == 0 {
         Err(DomainError::VersionConflict {
             entity: String::new(),
