--- crates/infra/src/event_store/command_adapters.rs
+++ delete match arm ExpectedVersion::Empty in version_from_expected
@@ -420,17 +420,17 @@
     }
 }
 
 /// Map `ExpectedVersion` to the canonical domain version.
 /// Only used in error context to inform the caller what they supplied.
 fn version_from_expected(expected: ExpectedVersion) -> AggregateVersion {
     match expected {
         ExpectedVersion::Exact(v) => AggregateVersion(v),
-        ExpectedVersion::Empty => AggregateVersion::INITIAL,
+         /* ~ changed by cargo-mutants ~ */
         _ => AggregateVersion::INITIAL,
     }
 }
 
 /// Check that a domain version is non-zero (valid for update operations).
 /// Returns `DomainError::VersionConflict` when `version.0 == 0`.
 fn check_nonzero_version(version: AggregateVersion) -> Result<(), DomainError> {
     if version.0 == 0 {
