--- crates/infra/src/event_store/command_adapters.rs
+++ replace check_nonzero_version -> Result<(), DomainError> with Ok(())
@@ -428,25 +428,17 @@
         ExpectedVersion::Empty => AggregateVersion::INITIAL,
         _ => AggregateVersion::INITIAL,
     }
 }
 
 /// Check that a domain version is non-zero (valid for update operations).
 /// Returns `DomainError::VersionConflict` when `version.0 == 0`.
 fn check_nonzero_version(version: AggregateVersion) -> Result<(), DomainError> {
-    if version.0 == 0 {
-        Err(DomainError::VersionConflict {
-            entity: String::new(),
-            expected: AggregateVersion(0),
-            current: AggregateVersion(0),
-        })
-    } else {
-        Ok(())
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod translation_tests {
     use super::*;
 
     #[test]
     fn stream_to_domain_basic() {
