--- crates/infra/src/projectors/calculation.rs
+++ replace upsert_calculation_item -> Result<(), sqlx::Error> with Ok(())
@@ -183,30 +183,10 @@
     }
 }
 
 async fn upsert_calculation_item<'b>(
     ctx: &mut Transaction<'b, Postgres>,
     calculation_id: Uuid,
     item: &breakdown_core::calculation::events::CalculationItem,
 ) -> Result<(), sqlx::Error> {
-    sqlx::query(
-        r#"
-        INSERT INTO projection_calculation_item
-            (calculation_id, item_id, name, quantity, unit_price, is_paid)
-        VALUES ($1, $2, $3, $4::numeric, $5::numeric, $6)
-        ON CONFLICT (calculation_id, item_id) DO UPDATE SET
-            name = EXCLUDED.name,
-            quantity = EXCLUDED.quantity,
-            unit_price = EXCLUDED.unit_price,
-            is_paid = EXCLUDED.is_paid
-        "#,
-    )
-    .bind(calculation_id)
-    .bind(item.id)
-    .bind(item.name.clone())
-    .bind(item.quantity.to_string())
-    .bind(item.unit_price.to_string())
-    .bind(item.is_paid)
-    .execute(&mut **ctx)
-    .await?;
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
