--- crates/infra/src/projectors/costume.rs
+++ replace CostumeProjector::touch_parent -> Result<(), sqlx::Error> with Ok(())
@@ -229,23 +229,11 @@
 
 impl CostumeProjector {
     async fn touch_parent<'b>(
         ctx: &mut Transaction<'b, Postgres>,
         id: Uuid,
         version: i64,
         updated_at: chrono::DateTime<chrono::Utc>,
     ) -> Result<(), sqlx::Error> {
-        sqlx::query(
-            r#"
-            UPDATE projection_costume
-            SET version = $2, updated_at = $3
-            WHERE id = $1
-            "#,
-        )
-        .bind(id)
-        .bind(version)
-        .bind(updated_at)
-        .execute(&mut **ctx)
-        .await?;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
