--- crates/infra/src/projectors/costume.rs
+++ replace <impl EntityEventHandler<CostumeAggregate, Transaction<'a, Postgres>> for CostumeProjector>::handle -> Result<(), Self::Error> with Ok(())
@@ -20,215 +20,17 @@
 
 impl<'a> EntityEventHandler<CostumeAggregate, Transaction<'a, Postgres>> for CostumeProjector {
     async fn handle(
         &mut self,
         ctx: &mut Transaction<'a, Postgres>,
         _id: Uuid,
         event: Event<CostumeEvent, ()>,
     ) -> Result<(), Self::Error> {
-        let updated_at = event.timestamp;
-
-        match event.data {
-            CostumeEvent::CostumeCreated {
-                id,
-                project_id,
-                character_id,
-                notes,
-                details,
-                photos,
-                version,
-            } => {
-                let version = version.0 as i64;
-                sqlx::query(
-                    r#"
-                    INSERT INTO projection_costume
-                        (id, project_id, character_id, notes, version, updated_at)
-                    VALUES ($1, $2, $3, $4, $5, $6)
-                    ON CONFLICT (id) DO UPDATE SET
-                        project_id = EXCLUDED.project_id,
-                        character_id = EXCLUDED.character_id,
-                        notes = EXCLUDED.notes,
-                        version = EXCLUDED.version,
-                        updated_at = EXCLUDED.updated_at
-                    "#,
-                )
-                .bind(id)
-                .bind(project_id.0)
-                .bind(character_id)
-                .bind(notes)
-                .bind(version)
-                .bind(updated_at)
-                .execute(&mut **ctx)
-                .await?;
-
-                for detail in details {
-                    sqlx::query(
-                        r#"
-                        INSERT INTO projection_costume_detail (costume_id, detail_id, text)
-                        VALUES ($1, $2, $3)
-                        ON CONFLICT (costume_id, detail_id) DO UPDATE SET
-                            text = EXCLUDED.text
-                        "#,
-                    )
-                    .bind(id)
-                    .bind(detail.id)
-                    .bind(detail.text)
-                    .execute(&mut **ctx)
-                    .await?;
-                }
-
-                for photo_id in photos {
-                    sqlx::query(
-                        r#"
-                        INSERT INTO projection_costume_photo (costume_id, photo_id)
-                        VALUES ($1, $2)
-                        ON CONFLICT (costume_id, photo_id) DO NOTHING
-                        "#,
-                    )
-                    .bind(id)
-                    .bind(photo_id)
-                    .execute(&mut **ctx)
-                    .await?;
-                }
-            }
-            CostumeEvent::CostumeNotesUpdated { id, notes, version } => {
-                let version = version.0 as i64;
-                sqlx::query(
-                    r#"
-                    UPDATE projection_costume
-                    SET notes = $2, version = $3, updated_at = $4
-                    WHERE id = $1
-                    "#,
-                )
-                .bind(id)
-                .bind(notes)
-                .bind(version)
-                .bind(updated_at)
-                .execute(&mut **ctx)
-                .await?;
-            }
-            CostumeEvent::CostumeAssignedToCharacter {
-                id,
-                character_id,
-                version,
-            } => {
-                let version = version.0 as i64;
-                sqlx::query(
-                    r#"
-                    UPDATE projection_costume
-                    SET character_id = $2, version = $3, updated_at = $4
-                    WHERE id = $1
-                    "#,
-                )
-                .bind(id)
-                .bind(character_id)
-                .bind(version)
-                .bind(updated_at)
-                .execute(&mut **ctx)
-                .await?;
-            }
-            CostumeEvent::CostumeUnassigned { id, version } => {
-                let version = version.0 as i64;
-                sqlx::query(
-                    r#"
-                    UPDATE projection_costume
-                    SET character_id = NULL, version = $2, updated_at = $3
-                    WHERE id = $1
-                    "#,
-                )
-                .bind(id)
-                .bind(version)
-                .bind(updated_at)
-                .execute(&mut **ctx)
-                .await?;
-            }
-            CostumeEvent::DetailAdded {
-                id,
-                detail,
-                version,
-            } => {
-                let version = version.0 as i64;
-                sqlx::query(
-                    r#"
-                    INSERT INTO projection_costume_detail (costume_id, detail_id, text)
-                    VALUES ($1, $2, $3)
-                    ON CONFLICT (costume_id, detail_id) DO UPDATE SET
-                        text = EXCLUDED.text
-                    "#,
-                )
-                .bind(id)
-                .bind(detail.id)
-                .bind(detail.text)
-                .execute(&mut **ctx)
-                .await?;
-
-                Self::touch_parent(ctx, id, version, updated_at).await?;
-            }
-            CostumeEvent::DetailRemoved {
-                id,
-                detail_id,
-                version,
-            } => {
-                let version = version.0 as i64;
-                sqlx::query(
-                    r#"
-                    DELETE FROM projection_costume_detail
-                    WHERE costume_id = $1 AND detail_id = $2
-                    "#,
-                )
-                .bind(id)
-                .bind(detail_id)
-                .execute(&mut **ctx)
-                .await?;
-
-                Self::touch_parent(ctx, id, version, updated_at).await?;
-            }
-            CostumeEvent::PhotoLinked {
-                id,
-                photo_id,
-                version,
-            } => {
-                let version = version.0 as i64;
-                sqlx::query(
-                    r#"
-                    INSERT INTO projection_costume_photo (costume_id, photo_id)
-                    VALUES ($1, $2)
-                    ON CONFLICT (costume_id, photo_id) DO NOTHING
-                    "#,
-                )
-                .bind(id)
-                .bind(photo_id)
-                .execute(&mut **ctx)
-                .await?;
-
-                Self::touch_parent(ctx, id, version, updated_at).await?;
-            }
-            CostumeEvent::PhotoUnlinked {
-                id,
-                photo_id,
-                version,
-            } => {
-                let version = version.0 as i64;
-                sqlx::query(
-                    r#"
-                    DELETE FROM projection_costume_photo
-                    WHERE costume_id = $1 AND photo_id = $2
-                    "#,
-                )
-                .bind(id)
-                .bind(photo_id)
-                .execute(&mut **ctx)
-                .await?;
-
-                Self::touch_parent(ctx, id, version, updated_at).await?;
-            }
-        }
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl CostumeProjector {
     async fn touch_parent<'b>(
         ctx: &mut Transaction<'b, Postgres>,
         id: Uuid,
         version: i64,
