--- crates/infra/src/projectors/mod.rs
+++ replace spawn_costume_projector -> Result<ActorRef<CostumeProcessor>> with Ok(ActorRef::from(Default::default()))
@@ -113,28 +113,17 @@
     Ok(actor_ref)
 }
 
 /// Spawn the costume projector actor and start its subscription loop.
 pub async fn spawn_costume_projector(
     pool: PgPool,
     redis_client: Arc<RedisClient>,
 ) -> Result<ActorRef<CostumeProcessor>> {
-    let conn = redis_client.get_multiplexed_tokio_connection().await?;
-    let processor = CostumeProcessor::new(
-        pool.clone(),
-        conn,
-        CHECKPOINTS_TABLE,
-        "costume",
-        CostumeProjector,
-    )
-    .await?;
-    let actor_ref = CostumeProcessor::spawn(processor);
-    run_projection_stream!(CostumeAggregate, "costume", redis_client, actor_ref.clone())?;
-    Ok(actor_ref)
+    Ok(ActorRef::from(Default::default())) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Spawn the calculation projector actor and start its subscription loop.
 pub async fn spawn_calculation_projector(
     pool: PgPool,
     redis_client: Arc<RedisClient>,
 ) -> Result<ActorRef<CalculationProcessor>> {
     let conn = redis_client.get_multiplexed_tokio_connection().await?;
