--- crates/infra/src/projectors/mod.rs
+++ replace spawn_scene_projector -> Result<ActorRef<SceneProcessor>> with Ok(ActorRef::new(Default::default()))
@@ -70,28 +70,17 @@
     }};
 }
 
 /// Spawn the scene projector actor and start its SierraDB subscription loop in the background.
 pub async fn spawn_scene_projector(
     pool: PgPool,
     redis_client: Arc<RedisClient>,
 ) -> Result<ActorRef<SceneProcessor>> {
-    let conn = redis_client.get_multiplexed_tokio_connection().await?;
-    let processor = SceneProcessor::new(
-        pool.clone(),
-        conn,
-        CHECKPOINTS_TABLE,
-        "scene",
-        SceneProjector,
-    )
-    .await?;
-    let actor_ref = SceneProcessor::spawn(processor);
-    run_projection_stream!(SceneAggregate, "scene", redis_client, actor_ref.clone())?;
-    Ok(actor_ref)
+    Ok(ActorRef::new(Default::default())) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Spawn the character projector actor and start its subscription loop.
 pub async fn spawn_character_projector(
     pool: PgPool,
     redis_client: Arc<RedisClient>,
 ) -> Result<ActorRef<CharacterProcessor>> {
     let conn = redis_client.get_multiplexed_tokio_connection().await?;
