--- crates/infra/src/projectors/mod.rs
+++ replace spawn_character_projector -> Result<ActorRef<CharacterProcessor>> with Ok(ActorRef::new(Default::default()))
@@ -89,33 +89,17 @@
     Ok(actor_ref)
 }
 
 /// Spawn the character projector actor and start its subscription loop.
 pub async fn spawn_character_projector(
     pool: PgPool,
     redis_client: Arc<RedisClient>,
 ) -> Result<ActorRef<CharacterProcessor>> {
-    let conn = redis_client.get_multiplexed_tokio_connection().await?;
-    let processor = CharacterProcessor::new(
-        pool.clone(),
-        conn,
-        CHECKPOINTS_TABLE,
-        "character",
-        CharacterProjector,
-    )
-    .await?;
-    let actor_ref = CharacterProcessor::spawn(processor);
-    run_projection_stream!(
-        CharacterAggregate,
-        "character",
-        redis_client,
-        actor_ref.clone()
-    )?;
-    Ok(actor_ref)
+    Ok(ActorRef::new(Default::default())) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Spawn the costume projector actor and start its subscription loop.
 pub async fn spawn_costume_projector(
     pool: PgPool,
     redis_client: Arc<RedisClient>,
 ) -> Result<ActorRef<CostumeProcessor>> {
     let conn = redis_client.get_multiplexed_tokio_connection().await?;
