--- crates/infra/src/projectors/scene.rs
+++ replace <impl EntityEventHandler<SceneAggregate, Transaction<'a, Postgres>> for SceneProjector>::handle -> Result<(), Self::Error> with Ok(())
@@ -20,141 +20,17 @@
 
 impl<'a> EntityEventHandler<SceneAggregate, Transaction<'a, Postgres>> for SceneProjector {
     async fn handle(
         &mut self,
         ctx: &mut Transaction<'a, Postgres>,
         _id: Uuid,
         event: Event<SceneEvent, ()>,
     ) -> Result<(), Self::Error> {
-        let updated_at = event.timestamp;
-
-        match event.data {
-            SceneEvent::SceneCreated {
-                id,
-                project_id,
-                details,
-                assigned_characters,
-                version,
-            } => {
-                let version = version.0 as i64;
-                sqlx::query(
-                    r#"
-                    INSERT INTO projection_scene
-                        (id, project_id, scene_number, location, mood, is_schedule_set, version, updated_at)
-                    VALUES ($1, $2, $3, $4, $5, $6, $7, $8)
-                    ON CONFLICT (id) DO UPDATE SET
-                        project_id = EXCLUDED.project_id,
-                        scene_number = EXCLUDED.scene_number,
-                        location = EXCLUDED.location,
-                        mood = EXCLUDED.mood,
-                        is_schedule_set = EXCLUDED.is_schedule_set,
-                        version = EXCLUDED.version,
-                        updated_at = EXCLUDED.updated_at
-                    "#,
-                )
-                .bind(id)
-                .bind(project_id.0)
-                .bind(details.scene_number.map(|n| n as i32))
-                .bind(details.location)
-                .bind(details.mood)
-                .bind(details.is_schedule_set)
-                .bind(version)
-                .bind(updated_at)
-                .execute(&mut **ctx)
-                .await?;
-
-                for character_id in assigned_characters {
-                    sqlx::query(
-                        r#"
-                        INSERT INTO projection_scene_character (scene_id, character_id, version)
-                        VALUES ($1, $2, $3)
-                        ON CONFLICT (scene_id, character_id) DO UPDATE SET
-                            version = EXCLUDED.version
-                        "#,
-                    )
-                    .bind(id)
-                    .bind(character_id)
-                    .bind(version)
-                    .execute(&mut **ctx)
-                    .await?;
-                }
-            }
-            SceneEvent::SceneDetailsUpdated {
-                id,
-                details,
-                version,
-            } => {
-                let version = version.0 as i64;
-                sqlx::query(
-                    r#"
-                    UPDATE projection_scene
-                    SET scene_number = $2,
-                        location = $3,
-                        mood = $4,
-                        is_schedule_set = $5,
-                        version = $6,
-                        updated_at = $7
-                    WHERE id = $1
-                    "#,
-                )
-                .bind(id)
-                .bind(details.scene_number.map(|n| n as i32))
-                .bind(details.location)
-                .bind(details.mood)
-                .bind(details.is_schedule_set)
-                .bind(version)
-                .bind(updated_at)
-                .execute(&mut **ctx)
-                .await?;
-            }
-            SceneEvent::CharacterAssigned {
-                id,
-                character_id,
-                version,
-            } => {
-                let version = version.0 as i64;
-                sqlx::query(
-                    r#"
-                    INSERT INTO projection_scene_character (scene_id, character_id, version)
-                    VALUES ($1, $2, $3)
-                    ON CONFLICT (scene_id, character_id) DO UPDATE SET
-                        version = EXCLUDED.version
-                    "#,
-                )
-                .bind(id)
-                .bind(character_id)
-                .bind(version)
-                .execute(&mut **ctx)
-                .await?;
-
-                Self::touch_parent(ctx, id, version, updated_at).await?;
-            }
-            SceneEvent::CharacterRemoved {
-                id,
-                character_id,
-                version,
-            } => {
-                let version = version.0 as i64;
-                sqlx::query(
-                    r#"
-                    DELETE FROM projection_scene_character
-                    WHERE scene_id = $1 AND character_id = $2
-                    "#,
-                )
-                .bind(id)
-                .bind(character_id)
-                .execute(&mut **ctx)
-                .await?;
-
-                Self::touch_parent(ctx, id, version, updated_at).await?;
-            }
-        }
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl SceneProjector {
     async fn touch_parent<'b>(
         ctx: &mut Transaction<'b, Postgres>,
         id: Uuid,
         version: i64,
