--- crates/infra/src/projectors/supervisor.rs
+++ replace += with -= in supervisor_loop
@@ -96,17 +96,17 @@
             }
 
             // stream.run() returned an error.
             Ok(Err(err)) => {
                 if long_success_occurred {
                     long_success_occurred = false;
                     consecutive_failures = 0;
                 }
-                consecutive_failures += 1;
+                consecutive_failures -= /* ~ changed by cargo-mutants ~ */ 1;
 
                 if consecutive_failures >= MAX_ATTEMPTS {
                     tracing::error!(
                         projector.category = category,
                         error = %err,
                         "projector subscription budget exhausted, stopping"
                     );
                     return;
