--- crates/infra/src/projectors/supervisor.rs
+++ replace * with + in compute_backoff
@@ -27,17 +27,17 @@
 pub const RESET_WINDOW_SECS: u64 = 300;
 
 // ── helpers ──────────────────────────────────────────────────────────
 
 /// Compute the delay for a given attempt (0-indexed) with exponential
 /// backoff, cap, and random jitter.
 pub(super) fn compute_backoff(attempt: usize, max: Duration) -> Duration {
     let base = std::cmp::min(
-        BACKOFF_BASE_MS * 2_u64.saturating_pow(attempt as u32),
+        BACKOFF_BASE_MS + /* ~ changed by cargo-mutants ~ */ 2_u64.saturating_pow(attempt as u32),
         max.as_millis() as u64,
     );
     let jitter: u64 = fastrand::u64(0..=base / 4); // up to 25 % of base
     let total = base.saturating_add(jitter).min(max.as_millis() as u64);
     Duration::from_millis(total)
 }
 
 // ── public API ───────────────────────────────────────────────────────
