--- crates/infra/src/projectors/supervisor.rs
+++ replace supervisor_loop with ()
@@ -64,106 +64,17 @@
     Ok(handle)
 }
 
 async fn supervisor_loop<F, Fut>(category: &'static str, make_epoch: F)
 where
     F: Fn() -> Fut + Send + 'static,
     Fut: Future<Output = anyhow::Result<()>> + Send + 'static,
 {
-    let mut consecutive_failures: usize = 0;
-    let mut long_success_occurred: bool = false;
-
-    loop {
-        tracing::info!(
-            projector.category = category,
-            "starting projector subscription stream"
-        );
-
-        let started_at = Instant::now();
-        let epoch_fut = make_epoch();
-
-        // tokio::spawn catches panics via JoinError — panics are
-        // treated as failures and follow the same backoff path.
-        let handle = tokio::spawn(epoch_fut);
-
-        match handle.await {
-            // Epoch completed successfully.
-            Ok(Ok(())) => {
-                if started_at.elapsed() >= Duration::from_secs(RESET_WINDOW_SECS) {
-                    long_success_occurred = true;
-                }
-                consecutive_failures = 0;
-                continue; // next epoch
-            }
-
-            // stream.run() returned an error.
-            Ok(Err(err)) => {
-                if long_success_occurred {
-                    long_success_occurred = false;
-                    consecutive_failures = 0;
-                }
-                consecutive_failures += 1;
-
-                if consecutive_failures >= MAX_ATTEMPTS {
-                    tracing::error!(
-                        projector.category = category,
-                        error = %err,
-                        "projector subscription budget exhausted, stopping"
-                    );
-                    return;
-                }
-
-                let delay = compute_backoff(
-                    consecutive_failures,
-                    Duration::from_millis(BACKOFF_MAX_DELAY_MS),
-                );
-                tracing::warn!(
-                    projector.category = category,
-                    attempt = consecutive_failures,
-                    delay_ms = delay.as_millis(),
-                    error = %err,
-                    "restarting projector subscription after error"
-                );
-                sleep(delay).await;
-            }
-
-            // Task panicked — caught via JoinError.
-            Err(join_err) => {
-                let payload = join_err.to_string();
-                if long_success_occurred {
-                    long_success_occurred = false;
-                    consecutive_failures = 0;
-                }
-                consecutive_failures += 1;
-
-                if consecutive_failures >= MAX_ATTEMPTS {
-                    tracing::error!(
-                        projector.category = category,
-                        error = %payload,
-                        "projector subscription budget exhausted after panic, stopping"
-                    );
-                    return;
-                }
-
-                let delay = compute_backoff(
-                    consecutive_failures,
-                    Duration::from_millis(BACKOFF_MAX_DELAY_MS),
-                );
-                tracing::warn!(
-                    projector.category = category,
-                    attempt = consecutive_failures,
-                    delay_ms = delay.as_millis(),
-                    error = %payload,
-                    "restarting projector subscription after panic"
-                );
-                sleep(delay).await;
-            }
-        }
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use std::future::Future;
     use std::sync::atomic::{AtomicUsize, Ordering};
     use std::sync::{Arc, Mutex};
