--- crates/infra/src/queries/calculation.rs
+++ replace <impl CalculationRepository for CalculationRepositoryImpl>::calculation_with_items -> Result<CalculationView, DomainError> with Ok(Default::default())
@@ -102,17 +102,17 @@
         .map_err(|e| DomainError::Conflict(e.to_string()))?;
 
         rows.into_iter()
             .map(map_calculation_row)
             .collect::<Result<Vec<_>, _>>()
     }
 
     async fn calculation_with_items(&self, id: Uuid) -> Result<CalculationView, DomainError> {
-        self.calculation_with_items(id).await
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn map_calculation_row(row: sqlx::postgres::PgRow) -> Result<CalculationView, DomainError> {
     let header_json: serde_json::Value = row.try_get("header").map_err(map_err)?;
     Ok(CalculationView {
         id: row.try_get("id").map_err(map_err)?,
         project_id: ProjectId(row.try_get("project_id").map_err(map_err)?),
