--- crates/infra/src/queries/calculation.rs
+++ replace CalculationRepositoryImpl::calculation_with_items -> Result<CalculationView, DomainError> with Ok(Default::default())
@@ -18,32 +18,17 @@
 }
 
 impl CalculationRepositoryImpl {
     pub fn new(pool: PgPool) -> Self {
         Self { pool }
     }
 
     async fn calculation_with_items(&self, id: Uuid) -> Result<CalculationView, DomainError> {
-        let row = sqlx::query(
-            r#"
-            SELECT id, project_id, header, version, updated_at
-            FROM projection_calculation
-            WHERE id = $1
-            "#,
-        )
-        .bind(id)
-        .fetch_optional(&self.pool)
-        .await
-        .map_err(|e| DomainError::Conflict(e.to_string()))?
-        .ok_or_else(|| DomainError::NotFound(format!("Calculation({id})")))?;
-
-        let mut view = map_calculation_row(row)?;
-        view.items = self.items_for(id).await?;
-        Ok(view)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn items_for(
         &self,
         calculation_id: Uuid,
     ) -> Result<Vec<CalculationItemView>, DomainError> {
         let rows = sqlx::query(
             r#"
