--- crates/infra/src/queries/calculation.rs
+++ replace CalculationRepositoryImpl::items_for -> Result<Vec<CalculationItemView>, DomainError> with Ok(vec![])
@@ -40,42 +40,17 @@
         view.items = self.items_for(id).await?;
         Ok(view)
     }
 
     async fn items_for(
         &self,
         calculation_id: Uuid,
     ) -> Result<Vec<CalculationItemView>, DomainError> {
-        let rows = sqlx::query(
-            r#"
-            SELECT item_id, name, quantity::text AS quantity, unit_price::text AS unit_price, is_paid
-            FROM projection_calculation_item
-            WHERE calculation_id = $1
-            ORDER BY item_id
-            "#,
-        )
-        .bind(calculation_id)
-        .fetch_all(&self.pool)
-        .await
-        .map_err(|e| DomainError::Conflict(e.to_string()))?;
-
-        rows.into_iter()
-            .map(|row| {
-                let quantity: String = row.try_get("quantity").map_err(map_err)?;
-                let unit_price: String = row.try_get("unit_price").map_err(map_err)?;
-                Ok(CalculationItemView {
-                    id: row.try_get("item_id").map_err(map_err)?,
-                    name: row.try_get("name").map_err(map_err)?,
-                    quantity: quantity.parse().unwrap_or_default(),
-                    unit_price: unit_price.parse().unwrap_or_default(),
-                    is_paid: row.try_get("is_paid").map_err(map_err)?,
-                })
-            })
-            .collect::<Result<Vec<_>, DomainError>>()
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl CalculationRepository for CalculationRepositoryImpl {
     async fn find_by_id(&self, id: Uuid) -> Result<CalculationView, DomainError> {
         self.calculation_with_items(id).await
     }
 
