--- crates/infra/src/queries/character.rs
+++ replace <impl CharacterRepository for CharacterRepositoryImpl>::list_by_project -> Result<Vec<CharacterView>, DomainError> with Ok(vec![Default::default()])
@@ -43,34 +43,17 @@
     }
 
     async fn list_by_project(
         &self,
         project_id: ProjectId,
         limit: i64,
         offset: i64,
     ) -> Result<Vec<CharacterView>, DomainError> {
-        let rows = sqlx::query(
-            r#"
-            SELECT id, project_id, name, is_extra, is_main_character,
-                   measurements, contact, version, updated_at
-            FROM projection_character
-            WHERE project_id = $1
-            ORDER BY name
-            LIMIT $2 OFFSET $3
-            "#,
-        )
-        .bind(project_id.0)
-        .bind(limit)
-        .bind(offset)
-        .fetch_all(&self.pool)
-        .await
-        .map_err(|e| DomainError::Conflict(e.to_string()))?;
-
-        rows.into_iter().map(map_character_row).collect()
+        Ok(vec![Default::default()]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn map_character_row(row: sqlx::postgres::PgRow) -> Result<CharacterView, DomainError> {
     let measurements_json: serde_json::Value = row.try_get("measurements").map_err(map_err)?;
     let contact_json: serde_json::Value = row.try_get("contact").map_err(map_err)?;
 
     Ok(CharacterView {
