--- crates/infra/src/queries/character.rs
+++ replace map_character_row -> Result<CharacterView, DomainError> with Ok(Default::default())
@@ -65,29 +65,14 @@
         .await
         .map_err(|e| DomainError::Conflict(e.to_string()))?;
 
         rows.into_iter().map(map_character_row).collect()
     }
 }
 
 fn map_character_row(row: sqlx::postgres::PgRow) -> Result<CharacterView, DomainError> {
-    let measurements_json: serde_json::Value = row.try_get("measurements").map_err(map_err)?;
-    let contact_json: serde_json::Value = row.try_get("contact").map_err(map_err)?;
-
-    Ok(CharacterView {
-        id: row.try_get("id").map_err(map_err)?,
-        project_id: ProjectId(row.try_get("project_id").map_err(map_err)?),
-        name: row.try_get("name").map_err(map_err)?,
-        is_extra: row.try_get("is_extra").map_err(map_err)?,
-        is_main_character: row.try_get("is_main_character").map_err(map_err)?,
-        measurements: serde_json::from_value(measurements_json).unwrap_or_default(),
-        contact: serde_json::from_value(contact_json).unwrap_or_default(),
-        version: AggregateVersion(row.try_get::<i64, _>("version").map_err(map_err)? as u64),
-        updated_at: row
-            .try_get::<DateTime<Utc>, _>("updated_at")
-            .map_err(map_err)?,
-    })
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn map_err(e: sqlx::Error) -> DomainError {
     DomainError::Conflict(e.to_string())
 }
