--- crates/infra/src/queries/costume.rs
+++ replace <impl CostumeRepository for CostumeRepositoryImpl>::costumes_by_character -> Result<Vec<CostumeView>, DomainError> with Ok(vec![])
@@ -124,32 +124,17 @@
             .map(map_costume_row)
             .collect::<Result<Vec<_>, _>>()
     }
 
     async fn costumes_by_character(
         &self,
         character_id: Uuid,
     ) -> Result<Vec<CostumeView>, DomainError> {
-        let rows = sqlx::query(
-            r#"
-            SELECT id, project_id, character_id, notes, version, updated_at
-            FROM projection_costume
-            WHERE character_id = $1
-            ORDER BY updated_at DESC
-            "#,
-        )
-        .bind(character_id)
-        .fetch_all(&self.pool)
-        .await
-        .map_err(|e| DomainError::Conflict(e.to_string()))?;
-
-        rows.into_iter()
-            .map(map_costume_row)
-            .collect::<Result<Vec<_>, _>>()
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn costume_with_details_photos(&self, id: Uuid) -> Result<CostumeView, DomainError> {
         self.costumefind_by_id_with_children(id).await
     }
 }
 
 fn map_costume_row(row: sqlx::postgres::PgRow) -> Result<CostumeView, DomainError> {
