--- crates/infra/src/queries/costume.rs
+++ replace <impl CostumeRepository for CostumeRepositoryImpl>::costume_with_details_photos -> Result<CostumeView, DomainError> with Ok(Default::default())
@@ -143,17 +143,17 @@
         .map_err(|e| DomainError::Conflict(e.to_string()))?;
 
         rows.into_iter()
             .map(map_costume_row)
             .collect::<Result<Vec<_>, _>>()
     }
 
     async fn costume_with_details_photos(&self, id: Uuid) -> Result<CostumeView, DomainError> {
-        self.costumefind_by_id_with_children(id).await
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn map_costume_row(row: sqlx::postgres::PgRow) -> Result<CostumeView, DomainError> {
     Ok(CostumeView {
         id: row.try_get("id").map_err(map_err)?,
         project_id: ProjectId(row.try_get("project_id").map_err(map_err)?),
         character_id: row.try_get("character_id").map_err(map_err)?,
