--- crates/infra/src/queries/costume.rs
+++ replace map_costume_row -> Result<CostumeView, DomainError> with Ok(Default::default())
@@ -148,25 +148,14 @@
     }
 
     async fn costume_with_details_photos(&self, id: Uuid) -> Result<CostumeView, DomainError> {
         self.costumefind_by_id_with_children(id).await
     }
 }
 
 fn map_costume_row(row: sqlx::postgres::PgRow) -> Result<CostumeView, DomainError> {
-    Ok(CostumeView {
-        id: row.try_get("id").map_err(map_err)?,
-        project_id: ProjectId(row.try_get("project_id").map_err(map_err)?),
-        character_id: row.try_get("character_id").map_err(map_err)?,
-        notes: row.try_get("notes").map_err(map_err)?,
-        details: Vec::new(),
-        photos: Vec::new(),
-        version: AggregateVersion(row.try_get::<i64, _>("version").map_err(map_err)? as u64),
-        updated_at: row
-            .try_get::<DateTime<Utc>, _>("updated_at")
-            .map_err(map_err)?,
-    })
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn map_err(e: sqlx::Error) -> DomainError {
     DomainError::Conflict(e.to_string())
 }
