--- crates/infra/src/queries/costume.rs
+++ replace <impl CostumeRepository for CostumeRepositoryImpl>::find_by_id -> Result<CostumeView, DomainError> with Ok(Default::default())
@@ -90,17 +90,17 @@
             photos,
             ..view
         })
     }
 }
 
 impl CostumeRepository for CostumeRepositoryImpl {
     async fn find_by_id(&self, id: Uuid) -> Result<CostumeView, DomainError> {
-        self.costumefind_by_id_with_children(id).await
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn list_by_project(
         &self,
         project_id: ProjectId,
         limit: i64,
         offset: i64,
     ) -> Result<Vec<CostumeView>, DomainError> {
