--- crates/infra/src/queries/scene.rs
+++ replace <impl SceneRepository for SceneRepositoryImpl>::scenes_by_character -> Result<Vec<SceneView>, DomainError> with Ok(vec![Default::default()])
@@ -92,41 +92,17 @@
         .fetch_all(&self.pool)
         .await
         .map_err(|e| DomainError::Conflict(e.to_string()))?;
 
         rows.into_iter().map(map_scene_row).collect()
     }
 
     async fn scenes_by_character(&self, character_id: Uuid) -> Result<Vec<SceneView>, DomainError> {
-        let rows = sqlx::query(
-            r#"
-            SELECT
-                s.id,
-                s.project_id,
-                s.scene_number,
-                s.location,
-                s.mood,
-                s.is_schedule_set,
-                s.version,
-                s.updated_at,
-                COALESCE(array_agg(sc2.character_id) FILTER (WHERE sc2.character_id IS NOT NULL), ARRAY[]::uuid[]) AS assigned_characters
-            FROM projection_scene s
-            JOIN projection_scene_character sc ON sc.scene_id = s.id AND sc.character_id = $1
-            LEFT JOIN projection_scene_character sc2 ON sc2.scene_id = s.id
-            GROUP BY s.id
-            ORDER BY s.scene_number, s.updated_at DESC
-            "#,
-        )
-        .bind(character_id)
-        .fetch_all(&self.pool)
-        .await
-        .map_err(|e| DomainError::Conflict(e.to_string()))?;
-
-        rows.into_iter().map(map_scene_row).collect()
+        Ok(vec![Default::default()]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn map_scene_row(row: sqlx::postgres::PgRow) -> Result<SceneView, DomainError> {
     let scene_number: Option<i32> = row.try_get("scene_number").map_err(map_err)?;
     Ok(SceneView {
         id: row.try_get("id").map_err(map_err)?,
         project_id: ProjectId(row.try_get("project_id").map_err(map_err)?),
