--- crates/infra/src/queries/scene.rs
+++ replace map_scene_row -> Result<SceneView, DomainError> with Ok(Default::default())
@@ -121,27 +121,14 @@
         .await
         .map_err(|e| DomainError::Conflict(e.to_string()))?;
 
         rows.into_iter().map(map_scene_row).collect()
     }
 }
 
 fn map_scene_row(row: sqlx::postgres::PgRow) -> Result<SceneView, DomainError> {
-    let scene_number: Option<i32> = row.try_get("scene_number").map_err(map_err)?;
-    Ok(SceneView {
-        id: row.try_get("id").map_err(map_err)?,
-        project_id: ProjectId(row.try_get("project_id").map_err(map_err)?),
-        scene_number: scene_number.map(|n| n as u32),
-        location: row.try_get("location").map_err(map_err)?,
-        mood: row.try_get("mood").map_err(map_err)?,
-        is_schedule_set: row.try_get("is_schedule_set").map_err(map_err)?,
-        assigned_characters: row.try_get("assigned_characters").map_err(map_err)?,
-        version: AggregateVersion(row.try_get::<i64, _>("version").map_err(map_err)? as u64),
-        updated_at: row
-            .try_get::<DateTime<Utc>, _>("updated_at")
-            .map_err(map_err)?,
-    })
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn map_err(e: sqlx::Error) -> DomainError {
     DomainError::Conflict(e.to_string())
 }
