--- crates/infra/src/queries/scene.rs
+++ replace <impl SceneRepository for SceneRepositoryImpl>::find_by_id -> Result<SceneView, DomainError> with Ok(Default::default())
@@ -28,41 +28,17 @@
     #[cfg(test)]
     pub fn pool(&self) -> &PgPool {
         &self.pool
     }
 }
 
 impl SceneRepository for SceneRepositoryImpl {
     async fn find_by_id(&self, id: Uuid) -> Result<SceneView, DomainError> {
-        let row = sqlx::query(
-            r#"
-            SELECT
-                s.id,
-                s.project_id,
-                s.scene_number,
-                s.location,
-                s.mood,
-                s.is_schedule_set,
-                s.version,
-                s.updated_at,
-                COALESCE(array_agg(sc.character_id) FILTER (WHERE sc.character_id IS NOT NULL), ARRAY[]::uuid[]) AS assigned_characters
-            FROM projection_scene s
-            LEFT JOIN projection_scene_character sc ON sc.scene_id = s.id
-            WHERE s.id = $1
-            GROUP BY s.id
-            "#,
-        )
-        .bind(id)
-        .fetch_optional(&self.pool)
-        .await
-        .map_err(|e| DomainError::Conflict(e.to_string()))?
-        .ok_or_else(|| DomainError::NotFound(format!("Scene({id})")))?;
-
-        map_scene_row(row)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn list_by_project(
         &self,
         project_id: ProjectId,
         limit: i64,
         offset: i64,
     ) -> Result<Vec<SceneView>, DomainError> {
