--- crates/infra/src/queries/scene.rs
+++ replace <impl SceneRepository for SceneRepositoryImpl>::list_by_project -> Result<Vec<SceneView>, DomainError> with Ok(vec![Default::default()])
@@ -61,44 +61,17 @@
     }
 
     async fn list_by_project(
         &self,
         project_id: ProjectId,
         limit: i64,
         offset: i64,
     ) -> Result<Vec<SceneView>, DomainError> {
-        let rows = sqlx::query(
-            r#"
-            SELECT
-                s.id,
-                s.project_id,
-                s.scene_number,
-                s.location,
-                s.mood,
-                s.is_schedule_set,
-                s.version,
-                s.updated_at,
-                COALESCE(array_agg(sc.character_id) FILTER (WHERE sc.character_id IS NOT NULL), ARRAY[]::uuid[]) AS assigned_characters
-            FROM projection_scene s
-            LEFT JOIN projection_scene_character sc ON sc.scene_id = s.id
-            WHERE s.project_id = $1
-            GROUP BY s.id
-            ORDER BY s.scene_number, s.updated_at DESC
-            LIMIT $2 OFFSET $3
-            "#,
-        )
-        .bind(project_id.0)
-        .bind(limit)
-        .bind(offset)
-        .fetch_all(&self.pool)
-        .await
-        .map_err(|e| DomainError::Conflict(e.to_string()))?;
-
-        rows.into_iter().map(map_scene_row).collect()
+        Ok(vec![Default::default()]) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn scenes_by_character(&self, character_id: Uuid) -> Result<Vec<SceneView>, DomainError> {
         let rows = sqlx::query(
             r#"
             SELECT
                 s.id,
                 s.project_id,
